'''
Изначально - 3 кнопки:
1 - начать игру
2 - настройки
3 - закончить игру

начать игру:
спрашивать ник
предыстория
обучение

'''

print('-'*22)
print('|        ╱╲          |')
print('|       /  ╲         |')
print('|      ╱ ╭╮ ╲        |')
print('|     |      |       |')
print('|     |      |       |')
print('|     |      |       |')
print('|     |      |       |')
print('|    /        \      |')
print('|   /          \      |')
print('|  /            \      |')
print('-'*22)


'''
        ╱╲
       /  ╲
      ╱ ╭╮ ╲
     |      |
     |      |
     |      |
     |      |
     /       \
    /         \
   /           \
'''
